{ airline: 'kq', heading: '4% off all online bookings from Maputo', detail: 'From 14th Sep to 31st Mar 2012, Kenya Airways is offering anyone purchasing a ticket from Maputo the chance to save 4% off the normal cost of a ticket. All you have to do is book and pay for your ticket online at kenya-airways.com. So remember, if you\'re flying from Maputo, first thing to do is log on kenya-airways.com and a 4% off...Easy, Fast and convenient' }
{ airline: 'kq', heading: '4% off all online bookings from Lilongwe, Malawi', detail: 'Kenya Airways is offering anyone purchasing a ticket from Malawi the chance to save 4% off the normal cost of a ticket. All you have to do is book and pay for your ticket online at kenya-airways.com. So remember, if you\'re flying from Malawi, first thing to do is log on kenya-airways.com and a 4% off...Easy, Fast and convenient. Valid till 31st March 2012' }
{ airline: 'kq', heading: 'Great special fares for online bookings from Johannesburg to Kenya and beyond into Africa', detail: 'Kenya Airways is offering anyone purchasing a ticket from Johannesburg the opportunity of great savings to Kenya and beyond into Africa. All you have to do is book and pay for your ticket online at kenya-airways.com. So remember, if you\'re flying from Johannesburg, first thing to do is log onto kenya-airways.com and benefit from great specials. Valid till 31st March 2012' }
{ airline: 'fly540', heading: 'Special offer to US$189 Bujumbura', detail: 'Fly540 special offer US$189 to Bujumbura, book in the next month to qualify'}
{ airline: 'fly540', heading: 'Special offer to US$60 Mombasa', detail: 'Fly540 special offer US$60 to Mombasa, book in the next month to qualify'}
{ airline: 'fly540', heading: 'Special offer to US$70 Zanzibar', detail: 'Fly540 special offer US$70 Zanzibar from Mombasa, book in the next month to qualify'}
{ airline: 'fly540', heading: 'Jet to Kisumu 2X Daily', detail: 'From only sh8540 all inclusive return fares, contact your preferred travel agent or call 0724 563009 or book online: www.fly540.com'}